ERP DEV.WMS/src/Catalogs/вмс_НаборыДополнительныхРеквизитов/вмс_НаборыДополнительныхРеквизитов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>вмс_НаборыДополнительныхРеквизитов</name>
  <hierarchical>true</hierarchical>
  <tabularSections>
    <name>Владельцы</name>
    <attributes>
      <name>Владелец</name>
      <type>
        <types>CatalogRef.вмс_Контейнеры</types>
        <types>CatalogRef.вмс_ПравилаЗаполненияЗадачиКладовщику</types>
        <types>CatalogRef.вмс_Операции</types>
        <types>CatalogRef.вмс_ВидыПартийТоваров</types>
        <types>CatalogRef.вмс_НастройкиОператора</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.вмс_ДополнительныеРеквизиты</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

ERP DEV.WMS/src/Catalogs/вмс_Операции/вмс_Операции.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>вмс_Операции</name>
  <hierarchical>true</hierarchical>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <attributes>
    <name>ДанныеСКД</name>
    <type>
      <types>CatalogRef.вмс_ИсточникиДанных</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаданиеКладовщикуРаспоряжение</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗапрашиватьУслугиХранения</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяДляПоиска</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИмяФормы</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КлассОперации</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>300</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КлассОперацииХранилище</name>
    <type>
      <types>CatalogRef.вмс_ИсточникиДанных</types>
    </type>
  </attributes>
  <attributes>
    <name>НачальнаяФорма</name>
    <type>
      <types>CatalogRef.вмс_ИнтерфейсыТСД</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбработкаВФормеСписка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоРаспоряжению</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Поток</name>
    <type>
      <types>EnumRef.вмс_СкладскиеПотоки</types>
    </type>
  </attributes>
  <attributes>
    <name>ПредопределенныеДанные</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РазбиватьПоПомещениям</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ХранилищеСКДДокументы</name>
    <type>
      <types>CatalogRef.вмс_ИсточникиДанных</types>
    </type>
  </attributes>
  <attributes>
    <name>ХранилищеСКДЗаданияКладовщику</name>
    <type>
      <types>CatalogRef.вмс_ИсточникиДанных</types>
    </type>
  </attributes>
  <attributes>
    <name>ХранилищеСхемыКомпоновкиДанных</name>
    <type>
      <types>CatalogRef.вмс_ИсточникиДанных</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭтоИнвентаризация</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьДанныеСКД</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьКлассОперацииХранилище</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьХранилищеСКДДокументы</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьХранилищеСКДЗаданияКладовщику</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьХранилищеСхемыКомпоновкиДанных</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Распоряжения</name>
    <attributes>
      <name>Имя</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>300</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>300</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СсылкаНаРаспоряжение</name>
      <type>
        <types>CatalogRef.вмс_РаспоряженияОпераций</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ЭтапыОперации</name>
    <attributes>
      <name>Этап</name>
      <type>
        <types>CatalogRef.вмс_ЭтапыОперации</types>
      </type>
    </attributes>
    <attributes>
      <name>Статус</name>
      <type>
        <types>CatalogRef.вмс_СтатусыДокументов</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СвойстваОперации</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.вмс_СвойстваОпераций</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Boolean</types>
        <types>String</types>
        <types>Date</types>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ОтветственноеХранение</name>
    <attributes>
      <name>Операция</name>
      <type>
        <types>CatalogRef.вмс_УслугиОтветственногоХранения</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.вмс_ДополнительныеРеквизиты</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.вмс_ДополнительныеРеквизиты</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПочтовыеРассылки</name>
    <attributes>
      <name>Рассылка</name>
      <type>
        <types>CatalogRef.вмс_ПочтовыеРассылки</types>
      </type>
    </attributes>
    <attributes>
      <name>Активная</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Алгоритмы</name>
    <attributes>
      <name>Алгоритм</name>
      <type>
        <types>CatalogRef.вмс_Алгоритмы</types>
      </type>
    </attributes>
    <attributes>
      <name>ПриСохранении</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ПриЗавершении</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПравилоКонвертации</name>
      <type>
        <types>CatalogRef.вмс_ПравилаКонвертацииРеквизитов</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ОбработкиПередЗавершением</name>
    <attributes>
      <name>Использование</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Обработка</name>
      <type>
        <types>CatalogRef.вмс_ИнтерфейсыТСД</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ОперацииПлана</name>
    <attributes>
      <name>Операция</name>
      <type>
        <types>CatalogRef.вмс_Операции</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПараметрыОперации</name>
    <attributes>
      <name>Имя</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>НаФронтенде</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>НаБэкенде</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ФормыОперации</name>
    <attributes>
      <name>МакетФормы</name>
      <type>
        <types>CatalogRef.вмс_ИнтерфейсыТСД</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>МетодыОперации</name>
    <attributes>
      <name>ИмяМетода</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Данные</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>НормыKPI</name>
    <attributes>
      <name>КоличествоМинут</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоЕдиниц</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Единица</name>
      <type>
        <types>EnumRef.вмс_ЕдиницыИзмеренияKPI</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

ERP DEV.WMS/src/CommonModules/вмс_УправлениеСвойствамиСервер/Module.bsl
Функция глОбщийМодуль(ИмяМодуля)
	Возврат вмс_ОбщегоНазначенияКлиентСервер.ОбщийМодуль(ИмяМодуля);
КонецФункции

Функция ИнициализироватьДополнительныеРеквизиты(Форма, Объект, знач ВладелецДополнительныхРеквизитов=Неопределено, ГруппаДополнительныхРеквизитов=Неопределено)
	
	Перем РаботаСФормамиСервер;
	
	Если глОбщийМодуль("УправлениеСвойствамиКлиентСервер").ДополнительныеРеквизитыИнициализированы(Форма) Тогда
		Возврат Истина;
	КонецЕсли;
	
	Если ТипЗнч(Форма) <> Тип("ФормаКлиентскогоПриложения") Тогда
		Возврат Ложь;
	КонецЕсли;
	
	РаботаСФормамиСервер = глОбщийМодуль("РаботаСФормамиСервер");
	
	Если РаботаСФормамиСервер.НайтиРеквизит(Форма, "ИнформацияОДополнительныхРеквизитов") = Неопределено Тогда
		Если ВладелецДополнительныхРеквизитов=Неопределено Тогда
			ВладелецДополнительныхРеквизитов = Объект.Ссылка;
		КонецЕсли;
		
		ИнформацияОДополнительныхРеквизитов = Новый Структура;
		ИнформацияОДополнительныхРеквизитов.Вставить("ИмяГруппыДополнительныхРеквизитов", ПолучитьИмяГруппыДополнительныхРеквизитов(Форма, ГруппаДополнительныхРеквизитов));
		ИнформацияОДополнительныхРеквизитов.Вставить("Владелец", ВладелецДополнительныхРеквизитов);
		
		МассивНовыхРеквизитов = Новый Массив;
		МассивНовыхРеквизитов.Добавить(Новый РеквизитФормы("ИнформацияОДополнительныхРеквизитов", Новый ОписаниеТипов));
		Форма.ИзменитьРеквизиты(МассивНовыхРеквизитов);
		
		Форма.ИнформацияОДополнительныхРеквизитов = ИнформацияОДополнительныхРеквизитов;
	КонецЕсли;
		
	Если РаботаСФормамиСервер.НайтиРеквизит(Форма, "ТаблицаДополнительныхРеквизитов") = Неопределено Тогда
		РаботаСФормамиСервер.СоздатьТаблицуФормы(Форма, "ТаблицаДополнительныхРеквизитов", "Свойство, ИмяЭлемента, ИмяРеквизита, ТипЗначенияСвойства");
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

Функция ПолучитьИмяГруппыДополнительныхРеквизитов(Форма, пГруппаДополнительныхРеквизитов=Неопределено) Экспорт
	
	Перем ГруппаДополнительныхРеквизитов;
	
	Если пГруппаДополнительныхРеквизитов <> Неопределено Тогда
		Если ТипЗнч(пГруппаДополнительныхРеквизитов) = Тип("Строка") Тогда
			Если Форма.Элементы.Найти(пГруппаДополнительныхРеквизитов) <> Неопределено Тогда
				ГруппаДополнительныхРеквизитов = пГруппаДополнительныхРеквизитов;
			КонецЕсли;
		Иначе
			ГруппаДополнительныхРеквизитов = пГруппаДополнительныхРеквизитов.Имя;
		КонецЕсли;
	КонецЕсли;
	
	Если ГруппаДополнительныхРеквизитов = Неопределено Тогда
		ГруппаДополнительныхРеквизитов = "ГруппаДополнительныхРеквизитов";
		ЭлементГруппы = Форма.Элементы.Добавить(ГруппаДополнительныхРеквизитов, Тип("ГруппаФормы"));
		ЭлементГруппы.Вид = ВидГруппыФормы.ОбычнаяГруппа;
		ЭлементГруппы.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
		ЭлементГруппы.ОтображатьЗаголовок = Ложь;
		ЭлементГруппы.Отображение = ОтображениеОбычнойГруппы.Нет;
	КонецЕсли;
	
	Возврат ГруппаДополнительныхРеквизитов;
	
КонецФункции

Функция ПолучитьТаблицуДополнительныхРеквизитовОбъекта(Объект) Экспорт
	
	Возврат ПолучитьТаблицуДополнительныхРеквизитовОбъектов(Объект);
	
КонецФункции
	
Функция ПолучитьТаблицуДополнительныхРеквизитовОбъектов(Объекты) Экспорт
	
	Запрос = ПолучитьЗапросПоДополнительнымРеквизитамОбъектов(Объекты);
	РезультатЗапроса = Запрос.Выполнить();
	ТаблицаСвойств = РезультатЗапроса.Выгрузить();
	ТаблицаСвойств.Сортировать("Номер");
	
	Возврат ТаблицаСвойств;
	
КонецФункции

Функция ПолучитьЗапросПоДополнительнымРеквизитамОбъектов(Объекты, ИмяВременнойТаблицы=Неопределено) Экспорт

	Перем РК, ОбщегоНазначенияСервер;
	
	РК = глОбщийМодуль("РаботаСКоллекциями");
	ОбщегоНазначенияСервер = глОбщийМодуль("ОбщегоНазначенияСервер");
	
	МассивОбъектов = РК.ЗначениеВМассив(Объекты, , Ложь);
	
	Запрос = Справочники.вмс_НаборыДополнительныхРеквизитов.ПолучитьЗапросПоНаборамОбъектов(МассивОбъектов, "НаборыСвойствОбъектов");
	ТекстЗапроса = Запрос.Текст;
	ТекстЗапроса = ТекстЗапроса + Символы.ПС + ";" + Символы.ПС + Символы.ПС;
	ТекстЗапроса = ТекстЗапроса +
	"ВЫБРАТЬ
	|	НаборыСвойствОбъектов.Объект КАК Объект,
	|	МИНИМУМ(вмс_НаборыДополнительныхРеквизитовДополнительныеРеквизиты.НомерСтроки) КАК Номер,
	|	вмс_ДополнительныеРеквизиты.Ссылка КАК Свойство
	|ПОМЕСТИТЬ ВТ
	|ИЗ
	|	НаборыСвойствОбъектов КАК НаборыСвойствОбъектов
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.вмс_НаборыДополнительныхРеквизитов.ДополнительныеРеквизиты КАК вмс_НаборыДополнительныхРеквизитовДополнительныеРеквизиты
	|		ПО НаборыСвойствОбъектов.Набор = вмс_НаборыДополнительныхРеквизитовДополнительныеРеквизиты.Ссылка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПланВидовХарактеристик.вмс_ДополнительныеРеквизиты КАК вмс_ДополнительныеРеквизиты
	|		ПО (вмс_НаборыДополнительныхРеквизитовДополнительныеРеквизиты.Свойство = вмс_ДополнительныеРеквизиты.Ссылка)
	|
	|СГРУППИРОВАТЬ ПО
	|	НаборыСвойствОбъектов.Объект,
	|	вмс_ДополнительныеРеквизиты.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ.Объект КАК Объект,
	|	ВТ.Номер КАК Номер,
	|	ВТ.Свойство КАК Свойство,
	|	ВТ.Свойство.Имя КАК Имя,
	|	ВТ.Свойство.Наименование КАК Представление,
	|	ВТ.Свойство.ТипЗначения КАК ТипЗначения
	|ПОМЕСТИТЬ Свойства
	|ИЗ
	|	ВТ КАК ВТ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	NULL КАК Объект,
	|	NULL КАК Свойство,
	|	0 КАК Значение
	|ПОМЕСТИТЬ ЗначенияСвойств
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Свойства.Объект КАК Объект,
	|	Свойства.Свойство КАК Свойство,
	|	Свойства.Номер КАК Номер,
	|	Свойства.Имя КАК ИмяСвойства,
	|	Свойства.Представление КАК ПредставлениеСвойства,
	|	Свойства.ТипЗначения КАК ТипЗначенияСвойства,
	|	ЗначенияСвойств.Значение КАК ЗначениеСвойства,
	|	&ИмяВременнойТаблицы КАК ИмяВременнойТаблицы
	|ИЗ
	|	Свойства КАК Свойства
	|		ЛЕВОЕ СОЕДИНЕНИЕ ЗначенияСвойств КАК ЗначенияСвойств
	|		ПО Свойства.Объект = ЗначенияСвойств.Объект
	|			И Свойства.Свойство = ЗначенияСвойств.Свойство";
	
	Привязка = "," + Символы.ПС + Символы.Таб + "&ИмяВременнойТаблицы КАК ИмяВременнойТаблицы";
	Если ЗначениеЗаполнено(ИмяВременнойТаблицы) Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, Привязка, Символы.ПС + "ПОМЕСТИТЬ " + ИмяВременнойТаблицы);
	Иначе
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, Привязка, "");
	КонецЕсли;
	
	//////////////////////////////////////////////////////////////////////////////////////////////////////////
	ТекстШаблонаЗапросаПоЗначениямСвойствОбъекта =
	"ВЫБРАТЬ
	|	ДополнительныеРеквизиты.Ссылка КАК Объект,
	|	ДополнительныеРеквизиты.Свойство КАК Свойство,
	|	ДополнительныеРеквизиты.Значение КАК Значение
	|ПОМЕСТИТЬ ЗначенияСвойств
	|ИЗ
	|	Справочник.вмс_Операции.ДополнительныеРеквизиты КАК ДополнительныеРеквизиты
	|ГДЕ
	|	ДополнительныеРеквизиты.Ссылка В(&ВладелецДополнительныхРеквизитов)";
	
	НомерПараметра = 1;
	ПрефиксПараметра = "ВладелецДополнительныхРеквизитов";
	СвязкаТекстовЗапросов = "
	|
	|ОБЪЕДИНИТЬ
	|
	|";
	
	ТекстЗапросовПоЗначениямСвойствОбъектов = "";
	ТаблицаБлизостиЭлементов = Неопределено;
	Если Запрос.Параметры.Свойство("ТаблицаБлизостиЭлементов", ТаблицаБлизостиЭлементов) Тогда
		ТаблицаИменТиповОбъектов = ТаблицаБлизостиЭлементов.Скопировать();
		ТаблицаИменТиповОбъектов.Колонки.Элемент.Имя = "Объект";
		ТаблицаИменТиповОбъектов.Свернуть("Объект, ИмяТипа");
	Иначе
		ТаблицаИменТиповОбъектов = ОбщегоНазначенияСервер.ПолучитьТаблицуИменТиповОбъектов(МассивОбъектов);
	КонецЕсли;
	ТаблицаИменТипов = ТаблицаИменТиповОбъектов.Скопировать();
	ТаблицаИменТипов.Свернуть("ИмяТипа");
	Для Каждого СтрокаИмениТипа Из ТаблицаИменТипов Цикл
		ИмяТипаОбъекта = СтрокаИмениТипа.ИмяТипа;
		МетаданныеОбъекта = Метаданные.НайтиПоПолномуИмени(ИмяТипаОбъекта);
		Если МетаданныеОбъекта = Неопределено ИЛИ Не Метаданные.Справочники.Содержит(МетаданныеОбъекта) И Не Метаданные.Документы.Содержит(МетаданныеОбъекта) И Не Метаданные.ПланыВидовХарактеристик.Содержит(МетаданныеОбъекта) Тогда
			Продолжить;
		КонецЕсли;
		
		МетаданныеТабличнойЧастиДополнительныеРеквизиты = МетаданныеОбъекта.ТабличныеЧасти.Найти("ДополнительныеРеквизиты");
		Если Не (МетаданныеТабличнойЧастиДополнительныеРеквизиты <> Неопределено И МетаданныеТабличнойЧастиДополнительныеРеквизиты.Реквизиты.Найти("Значение") <> Неопределено) Тогда
			Продолжить;
		КонецЕсли;
		СтрокиОбъектов = ТаблицаИменТиповОбъектов.НайтиСтроки(Новый Структура("ИмяТипа", ИмяТипаОбъекта));
		ОбъектыПоТипу = РК.ВыгрузитьЗначенияКолонкиКоллекции(СтрокиОбъектов, "Объект");
		НомерПараметраСтрока = Формат(НомерПараметра, "ЧГ=0");
		ИмяПараметра = ПрефиксПараметра + НомерПараметраСтрока;
		
		ТекстЗапросаПоЗначениямСвойствОбъекта = ТекстШаблонаЗапросаПоЗначениямСвойствОбъекта;
		ТекстЗапросаПоЗначениямСвойствОбъекта = СтрЗаменить(ТекстЗапросаПоЗначениямСвойствОбъекта, "Справочник.вмс_Операции", ИмяТипаОбъекта);
		ТекстЗапросаПоЗначениямСвойствОбъекта = СтрЗаменить(ТекстЗапросаПоЗначениямСвойствОбъекта, "&" + ПрефиксПараметра, "&" + ИмяПараметра);
		Если ТекстЗапросовПоЗначениямСвойствОбъектов <> "" Тогда
			ТекстЗапросовПоЗначениямСвойствОбъектов = ТекстЗапросовПоЗначениямСвойствОбъектов + СвязкаТекстовЗапросов;
			ТекстЗапросаПоЗначениямСвойствОбъекта = СтрЗаменить(ТекстЗапросаПоЗначениямСвойствОбъекта, "ПОМЕСТИТЬ ЗначенияСвойств" + Символы.ПС, "");
		КонецЕсли;
		ТекстЗапросовПоЗначениямСвойствОбъектов = ТекстЗапросовПоЗначениямСвойствОбъектов + ТекстЗапросаПоЗначениямСвойствОбъекта;
		Запрос.УстановитьПараметр(ИмяПараметра, ОбъектыПоТипу);
		НомерПараметра = НомерПараметра + 1;
	КонецЦикла;
	
	Если ТекстЗапросовПоЗначениямСвойствОбъектов <> "" Тогда
		ТекстЗапроса = РК.ВрезатьСтроку(ТекстЗапроса, Символы.ПС + Символы.ПС + ТекстЗапросовПоЗначениямСвойствОбъектов + Символы.ПС, "ПОМЕСТИТЬ ЗначенияСвойств", ";", ";");
	КонецЕсли;

	//////////////////////////////////////////////////////////////////////////////////////////////////////////
	Запрос.Текст = ТекстЗапроса;

	Возврат Запрос;
	
КонецФункции

Функция ОбновитьДополнительныеРеквизиты(Форма) Экспорт

	Перем УправлениеСвойствамиКлиентСервер, РаботаСФормамиКлиентСервер;
	
	УправлениеСвойствамиКлиентСервер = глОбщийМодуль("УправлениеСвойствамиКлиентСервер");
	РаботаСФормамиКлиентСервер = глОбщийМодуль("РаботаСФормамиКлиентСервер");
	
	Если Не УправлениеСвойствамиКлиентСервер.ДополнительныеРеквизитыИнициализированы(Форма) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ОчиститьДополнительныеРеквизиты(Форма);
	
	ИнформацияОДополнительныхРеквизитов = Форма.ИнформацияОДополнительныхРеквизитов;
	ГруппаДополнительныхРеквизитов = Форма.Элементы.Найти(ИнформацияОДополнительныхРеквизитов.ИмяГруппыДополнительныхРеквизитов);
	ТаблицаДополнительныхРеквизитовФормы = Форма.ТаблицаДополнительныхРеквизитов;
	ТаблицаДополнительныхРеквизитов = ПолучитьТаблицуДополнительныхРеквизитовОбъектов(Форма.Объект);
	ТипБулево = Тип("Булево");
	
	НовыеРеквизиты = Новый Массив;
	Для Каждого СтрокаДополнительногоРеквизита Из ТаблицаДополнительныхРеквизитов Цикл
		ИмяЭлемента = РаботаСФормамиКлиентСервер.ПолучитьНовоеИмяЭлементаФормы(Форма, "ДополнительныеРеквизит");
		ТипыДополнительногоРеквизита = СтрокаДополнительногоРеквизита.ТипЗначенияСвойства.Типы();
		ЭлементДополнительногоРеквизита = Форма.Элементы.Добавить(ИмяЭлемента, Тип("ПолеФормы"), ГруппаДополнительныхРеквизитов);
		Если ТипыДополнительногоРеквизита.Количество() = 1 И ТипыДополнительногоРеквизита[0] = ТипБулево <> Неопределено Тогда
			ЭлементДополнительногоРеквизита.Вид = ВидПоляФормы.ПолеФлажка;
		КонецЕсли;
		
		ИмяРеквизита = ИмяЭлемента;
		НовыеРеквизиты.Добавить(Новый РеквизитФормы(ИмяРеквизита, СтрокаДополнительногоРеквизита.ТипЗначенияСвойства, , СтрокаДополнительногоРеквизита.ПредставлениеСвойства));
		
		СтрокаДополнительногоРеквизитаФормы = ТаблицаДополнительныхРеквизитовФормы.Добавить();
		СтрокаДополнительногоРеквизитаФормы.Свойство = СтрокаДополнительногоРеквизита.Свойство;
		СтрокаДополнительногоРеквизитаФормы.ИмяЭлемента = ИмяЭлемента;
		СтрокаДополнительногоРеквизитаФормы.ИмяРеквизита = ИмяРеквизита;
		СтрокаДополнительногоРеквизитаФормы.ТипЗначенияСвойства = СтрокаДополнительногоРеквизита.ТипЗначенияСвойства;
	КонецЦикла;
	
	Форма.ИзменитьРеквизиты(НовыеРеквизиты);
	
	ТипЗначениеДополнительногоРеквизита = Тип("СправочникСсылка.вмс_ЗначенияСвойствОбъектов");
	
	Для Каждого СтрокаДополнительногоРеквизитаФормы Из ТаблицаДополнительныхРеквизитовФормы Цикл
		ЭлементДополнительногоРеквизита = Форма.Элементы.Найти(СтрокаДополнительногоРеквизитаФормы.ИмяЭлемента);
		ЭлементДополнительногоРеквизита.ПутьКДанным = СтрокаДополнительногоРеквизитаФормы.ИмяРеквизита;
		
		Если СтрокаДополнительногоРеквизитаФормы.ТипЗначенияСвойства.Типы().Найти(ТипЗначениеДополнительногоРеквизита) <> Неопределено Тогда
			ПараметрыВыбора = Новый Массив;
			НовыйПараметр = Новый ПараметрВыбора("Отбор.Владелец", СтрокаДополнительногоРеквизитаФормы.Свойство);
			ПараметрыВыбора.Добавить(НовыйПараметр);
			ПараметрыВыбора = Новый ФиксированныйМассив(ПараметрыВыбора);
			ЭлементДополнительногоРеквизита.ПараметрыВыбора = ПараметрыВыбора;
		КонецЕсли;
	КонецЦикла;
	
	ЗагрузитьЗначенияДополнительныхРеквизитов(Форма);
	
	Возврат Истина;
	
КонецФункции

Функция ОчиститьДополнительныеРеквизиты(Форма)
	
	Перем РК;
	
	РК = глОбщийМодуль("РаботаСКоллекциями");

	Если Форма.ТаблицаДополнительныхРеквизитов.Количество() > 0 Тогда
		Для каждого СтрокаДополнительногоРеквизитаФормы Из Форма.ТаблицаДополнительныхРеквизитов Цикл
			Элемент = Форма.Элементы.Найти(СтрокаДополнительногоРеквизитаФормы.ИмяЭлемента);
			Если Элемент <> Неопределено Тогда
				Форма.Элементы.Удалить(Элемент);
			КонецЕсли;
		КонецЦикла;
		Форма.ИзменитьРеквизиты(, РК.ВыгрузитьЗначенияКолонокКоллекции(Форма.ТаблицаДополнительныхРеквизитов, "ИмяРеквизита"));
		Форма.ТаблицаДополнительныхРеквизитов.Очистить();
	КонецЕсли;
	
КонецФункции

Функция ЗагрузитьЗначенияДополнительныхРеквизитов(Форма)

	ТаблицаДополнительныхРеквизитовФормы = Форма.ТаблицаДополнительныхРеквизитов;
	ТаблицаДополнительныхРеквизитов = Форма.Объект.ДополнительныеРеквизиты;

	Для Каждого СтрокаДополнительногоРеквизитаФормы Из ТаблицаДополнительныхРеквизитовФормы Цикл
		ИмяРеквизитаНаФорме = СтрокаДополнительногоРеквизитаФормы.ИмяРеквизита;
		
		НайденныеЗначения = ТаблицаДополнительныхРеквизитов.НайтиСтроки(Новый Структура("Свойство", СтрокаДополнительногоРеквизитаФормы.Свойство));
		Если НайденныеЗначения.Количество() > 0 Тогда
			ЗначениеРеквизита = НайденныеЗначения[0].Значение;
		Иначе
			ЗначениеРеквизита = Неопределено;
		КонецЕсли;
		
		ЗначениеРеквизита = СтрокаДополнительногоРеквизитаФормы.ТипЗначенияСвойства.ПривестиЗначение(ЗначениеРеквизита);
		Форма[ИмяРеквизитаНаФорме] = ЗначениеРеквизита;
	КонецЦикла;
	
КонецФункции

Функция СохранитьЗначенияДополнительныхРеквизитов(Форма, Объект) Экспорт
	
	Перем УправлениеСвойствамиКлиентСервер;
	
	УправлениеСвойствамиКлиентСервер = глОбщийМодуль("УправлениеСвойствамиКлиентСервер");
	
	Если Не УправлениеСвойствамиКлиентСервер.ДополнительныеРеквизитыИнициализированы(Форма) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ТаблицаДополнительныхРеквизитовФормы = Форма.ТаблицаДополнительныхРеквизитов;
	ТаблицаДополнительныхРеквизитов = Объект.ДополнительныеРеквизиты;

	Для Каждого СтрокаДополнительногоРеквизитаФормы Из ТаблицаДополнительныхРеквизитовФормы Цикл
		ИмяРеквизитаНаФорме = СтрокаДополнительногоРеквизитаФормы.ИмяРеквизита;
		
		НайденныеЗначения = ТаблицаДополнительныхРеквизитов.НайтиСтроки(Новый Структура("Свойство", СтрокаДополнительногоРеквизитаФормы.Свойство));
		Если НайденныеЗначения.Количество() > 0 Тогда
			СтрокаЗначения = НайденныеЗначения[0];
		Иначе
			СтрокаЗначения = ТаблицаДополнительныхРеквизитов.Добавить();
			СтрокаЗначения.Свойство = СтрокаДополнительногоРеквизитаФормы.Свойство;
		КонецЕсли;
		
		СтрокаЗначения.Значение = Форма[ИмяРеквизитаНаФорме];
	КонецЦикла;
	
	Возврат Истина;
	
КонецФункции

//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
Функция ПриСозданииНаСервере(Форма, Объект, знач ВладелецДополнительныхРеквизитов=Неопределено, ГруппаДополнительныхРеквизитов=Неопределено, Отказ=Ложь, СтандартнаяОбработка=Истина) Экспорт
	
	Перем УправлениеСвойствамиВызовСервера;
	
	УправлениеСвойствамиВызовСервера = глОбщийМодуль("УправлениеСвойствамиВызовСервера");
	
	Если Не УправлениеСвойствамиВызовСервера.ИспользоватьДополнительныеРеквизитыОбъекта(Объект.Ссылка) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Если Не ИнициализироватьДополнительныеРеквизиты(Форма, Объект, ВладелецДополнительныхРеквизитов, ГруппаДополнительныхРеквизитов) Тогда
		Возврат Ложь;
	КонецЕсли;

	ОбновитьДополнительныеРеквизиты(Форма);
	Возврат Истина;
	
КонецФункции

Функция ПередЗаписьюНаСервере(Форма, Отказ, ТекущийОбъект, ПараметрыЗаписи) Экспорт
	
	СохранитьЗначенияДополнительныхРеквизитов(Форма, ТекущийОбъект);
	
КонецФункции
